constant/pipe/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/pipe/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    top_pipe
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       115600;
    }
    pipe_to_water
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          8400;
        startFace       116000;
        sampleMode      nearestPatchFace;
        sampleRegion    water;
        samplePatch     water_to_pipe;
    }
)

// ************************************************************************* //
