constant/water/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/water/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       266400;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       266800;
    }
    outer_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       267200;
    }
    outer_2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       271200;
    }
    bottom_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       271600;
    }
    bottom_2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       272000;
    }
    bottom_3
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       272400;
    }
    water_to_pipe
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          8400;
        startFace       272800;
        sampleMode      nearestPatchFace;
        sampleRegion    pipe;
        samplePatch     pipe_to_water;
    }
)

// ************************************************************************* //
