constant/pipe/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/pipe";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation off;
radiationModel  none;


// radiationModel  opaqueSolid;

// absorptionEmissionModel constantAbsorptionEmission;

// constantAbsorptionEmissionCoeffs
// {
//     absorptivity    absorptivity [0 -1 0 0 0 0 0] 0.0;  //opaque
//     emissivity      emissivity [0 -1 0 0 0 0 0] 0.1;
//     E               E [1 -1 -3 0 0 0 0] 0;
// }

// scatterModel    none;

// sootModel       none;

// ************************************************************************* //