0/water/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/water";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
        // inletValue      $internalField;
        // value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.001);
    }
    outer_1
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
    outer_2
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
    bottom_1
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
    bottom_2
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
    bottom_3
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
    water_to_pipe
    {
     //   type            fixedValue; 
   //     value           uniform (0 0 0);
        type		noSlip;
    }
}
