system/pipe/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/pipe";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "e.*"
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-6;
        relTol           0.1;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}
solvers
{
    "h.*"
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-4; //1e-6;
        relTol           0.2; //0.1
    }
}

limitTemperature
{
    type	limitTemperature;
    active	true;
    limitTemperatureCoeffs
    {
        selectionMode all;
        Tmin	300;
        Tmax	350;
    }
}

relaxationFactors
{
    fields
    {
        "rho.*"         1;
        "p_rgh.*"       0.7;
    }
    equations
    {
        "U.*"           0.3;
        "(h|e).*"       0.3;
        "k.*"           0.3;
        "epsilon.*"     0.3;
    }
}

// ************************************************************************* //

