system/water/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/water";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    p_rgh
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-7;
        relTol           0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol           0;
    }

    "(U|h)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h)Final"
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
}

// relaxationFactors
// {
//     equations
//     {
//         h               0.3;
//         U               0.3;
//     }
// }

relaxationFactors
{
    fields
    {
        "rho.*"         1;
        "p_rgh.*"       0.7;
    }
    equations
    {
        "U.*"           0.3;
        "(h|e).*"       0.3;
        "k.*"           0.3;
        "epsilon.*"     0.3;
    }
}



// ************************************************************************* //
